//**********************************************************************
//
// Name:  <NCT6791DGpioSetup.uni>
//
// Description: NCT6791D GPIO Form String Definitions
//
//**********************************************************************
/=#
#include "VFR.uni"
//If customer define the common logical device by themselves, add here.

#string STR_NCT6791D_MISC_CONFIG		     #language eng "NCT6791D MISC Configuration"

// EUP ERP Feature (Deep S5 Mode)
#string	NCT6791D_DEEP_S5			     #language eng "NCT6791D Deep S5"
#string	STR_NCT6791D_EUP_ERP_PROMPT		     #language eng "EUP/ERP Mode"
#string	STR_NCT6791D_EUP_ERP_HELP		     #language eng "En/Disable EUP/ERP Mode feature for system ACPI S5 and Soft-Off state.\n \nNote:\nWhen Enabled, only power button can power-up system and the Wake Configuration items will be hidden."

// NCT6791D Restore On AC Power Loss
#string STR_NCT6791D_AC_PWR_LOSS		     #language eng "Restore On AC Power Loss"
#string STR_NCT6791D_AC_PWR_LOSS_HELP		     #language eng "Determine the system turn on or off after AC resume from G3 to S5 state."
#string STR_NCT6791D_PWR_OFF			     #language eng "Power Off"
#string STR_NCT6791D_PWR_ON			     #language eng "Power On"
#string STR_NCT6791D_LAST_STATE			     #language eng "Last State"
#string STR_NCT6791D_BYPASS			     #language eng "By Pass"

// NCT6791D UART RS485 Mode
#string STR_NCT6791D_UARTA_MODE			     #language eng "Serial Port A RS485 Mode"
#string STR_NCT6791D_UARTB_MODE			     #language eng "Serial Port B RS485 Mode"
#string STR_NCT6791D_RS485_EN			     #language eng "RS485 Auto Flow Control"
#string STR_NCT6791D_RS485_EN_HELP		     #language eng "En/Disable RS485 auto flow control function for UART Port."
#string STR_NCT6791D_RS485_INV			     #language eng "Invert RTSA# Behavior"
#string STR_NCT6791D_RS485_INV_HELP		     #language eng "Invert the behavior of RTSA# pin for RS485 auto flow control."

// NCT6791D GPIO Control
#string STR_NCT6791D_GPIO			     #language eng "NCT6791D GPIO Setting"
#string STR_GP00				     #language eng "GP00"
#string STR_GP01				     #language eng "GP01"
#string STR_GP02				     #language eng "GP02"
#string STR_GP03				     #language eng "GP03"
#string STR_GP04				     #language eng "GP04"
#string STR_GP05				     #language eng "GP05"
#string STR_GP06				     #language eng "GP06"
#string STR_GP07				     #language eng "GP07"
#string STR_GP10				     #language eng "GP10"
#string STR_GP11				     #language eng "GP11"
#string STR_GP12				     #language eng "GP12"
#string STR_GP13				     #language eng "GP13"
#string STR_GP14				     #language eng "GP14"
#string STR_GP15				     #language eng "GP15"
#string STR_GP16				     #language eng "GP16"
#string STR_GP17				     #language eng "GP17"
#string STR_GP20				     #language eng "GP20"
#string STR_GP21				     #language eng "GP21"
#string STR_GP22				     #language eng "GP22"
#string STR_GP23				     #language eng "GP23"
#string STR_GP24				     #language eng "GP24"
#string STR_GP25				     #language eng "GP25"
#string STR_GP26				     #language eng "GP26"
#string STR_GP27				     #language eng "GP27"
#string STR_GP30				     #language eng "GP30"
#string STR_GP31				     #language eng "GP31"
#string STR_GP32				     #language eng "GP32"
#string STR_GP33				     #language eng "GP33"
#string STR_GP34				     #language eng "GP34"
#string STR_GP35				     #language eng "GP35"
#string STR_GP36				     #language eng "GP36"
#string STR_GP40				     #language eng "GP40"
#string STR_GP41				     #language eng "GP41"
#string STR_GP42				     #language eng "GP42"
#string STR_GP43				     #language eng "GP43"
#string STR_GP44				     #language eng "GP44"
#string STR_GP45				     #language eng "GP45"
#string STR_GP46				     #language eng "GP46"
#string STR_GP47				     #language eng "GP47"
#string STR_GP50				     #language eng "GP50"
#string STR_GP51				     #language eng "GP51"
#string STR_GP52				     #language eng "GP52"
#string STR_GP53				     #language eng "GP53"
#string STR_GP54				     #language eng "GP54"
#string STR_GP55				     #language eng "GP55"
#string STR_GP56				     #language eng "GP56"
#string STR_GP57				     #language eng "GP57"
#string STR_GP60				     #language eng "GP60"
#string STR_GP61				     #language eng "GP61"
#string STR_GP62				     #language eng "GP62"
#string STR_GP63				     #language eng "GP63"
#string STR_GP64				     #language eng "GP64"
#string STR_GP65				     #language eng "GP65"
#string STR_GP66				     #language eng "GP66"
#string STR_GP67				     #language eng "GP67"
#string STR_GP70				     #language eng "GP70"
#string STR_GP71				     #language eng "GP71"
#string STR_GP72				     #language eng "GP72"
#string STR_GP73				     #language eng "GP73"
#string STR_GP74				     #language eng "GP74"
#string STR_GP75				     #language eng "GP75"
#string STR_GP76				     #language eng "GP76"
#string STR_GP80				     #language eng "GP80"
#string STR_GP81				     #language eng "GP81"
#string STR_GP82				     #language eng "GP82"
#string STR_GP83				     #language eng "GP83"
#string STR_GP84				     #language eng "GP84"
#string STR_GP85				     #language eng "GP85"
#string STR_GP86				     #language eng "GP86"
#string STR_GP87				     #language eng "GP87"
#string STR_GPIO_TYPE				     #language eng "  GPIO Type"
#string STR_GPIO_TYPE_HELP			     #language eng "GPIO Direction Type Setting"
#string STR_GPIO_OUTPUT				     #language eng "Output"
#string STR_GPIO_INPUT				     #language eng "Input"
#string STR_GPIO_DATA				     #language eng "    GPIO Data"
#string STR_GPIO_DATA_HELP			     #language eng "GPIO Output High/Low Setting"
#string STR_GPIO_LOW				     #language eng "Low"
#string STR_GPIO_HIGH				     #language eng "High"
#string STR_GPIO_INV				     #language eng "  GPIO Inversion"
#string STR_GPIO_INV_HELP			     #language eng "GPIO Inversion Setting"
#string STR_NORMAL				     #language eng "Normal"
#string STR_INVERTED				     #language eng "Inverted"

//#string <string name>                   #language eng ""
